OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx5.h
#define ADC_CCSR_CALSMP_Pos       (12U)
#define ADC_CCSR_CALSMP_Msk       (0x3UL << ADC_CCSR_CALSMP_Pos)                /*!< 0x00003000 */
#define ADC_CCSR_CALSMP           ADC_CCSR_CALSMP_Msk                           /*!< ADC calibration sample time selection */
#define ADC_CCSR_CALSMP_0         (0x1UL << ADC_CCSR_CALSMP_Pos)                /*!< 0x00001000 */
#define ADC_CCSR_CALSMP_1         (0x2UL << ADC_CCSR_CALSMP_Pos)                /*!< 0x00002000 */

#define ADC_CCSR_CALSET_Pos       (15U)
#define ADC_CCSR_CALSET_Msk       (0x1UL << ADC_CCSR_CALSET_Pos)                /*!< 0x00008000 */
#define ADC_CCSR_CALSET           ADC_CCSR_CALSET_Msk                           /*!< ADC Calibration factor selection */

#define ADC_CCSR_OFFSUC_Pos       (29U)
#define ADC_CCSR_OFFSUC_Msk       (0x1UL << ADC_CCSR_OFFSUC_Pos)                /*!< 0x20000000 */
#define ADC_CCSR_OFFSUC           ADC_CCSR_OFFSUC_Msk                           /*!< Offset Indicates the calibration status bit */

#define ADC_CCSR_CAPSUC_Pos       (30U)
#define ADC_CCSR_CAPSUC_Msk       (0x1UL << ADC_CCSR_CAPSUC_Pos)                /*!< 0x40000000 */
#define ADC_CCSR_CAPSUC           ADC_CCSR_CAPSUC_Msk                           /*!< ADC capacitance calibration flag bit */

#define ADC_CCSR_CALON_Pos        (31U)
#define ADC_CCSR_CALON_Msk        (0x1UL << ADC_CCSR_CALON_Pos)                 /*!< 0x80000000 */
#define ADC_CCSR_CALON            ADC_CCSR_CALON_Msk                            /*!< ADC calibration flag */

/*************************  ADC Common registers  *****************************/
/*******************  Bit definition for ADC_CCR register  ********************/
#define ADC_CCR_VREFBUF_EN_Pos    (5U)
#define ADC_CCR_VREFBUF_EN_Msk    (0x1UL << ADC_CCR_VREFBUF_EN_Pos)             /*!< 0x00000020 */
#define ADC_CCR_VREFBUF_EN        ADC_CCR_VREFBUF_EN_Msk                        /*!< ADC vrefbuffer enable */

#define ADC_CCR_VREFBUF_SEL_Pos   (6U)
#define ADC_CCR_VREFBUF_SEL_Msk   (0x3UL << ADC_CCR_VREFBUF_SEL_Pos)            /*!< 0x000000C0 */
#define ADC_CCR_VREFBUF_SEL       ADC_CCR_VREFBUF_SEL_Msk                       /*!< ADC vrefbuff output voltage select */
#define ADC_CCR_VREFBUF_SEL_0     (0x1UL << ADC_CCR_VREFBUF_SEL_Pos)            /*!< 0x00000040 */
#define ADC_CCR_VREFBUF_SEL_1     (0x2UL << ADC_CCR_VREFBUF_SEL_Pos)            /*!< 0x00000080 */

#define ADC_CCR_VREFEN_Pos        (22U)
#define ADC_CCR_VREFEN_Msk        (0x1UL << ADC_CCR_VREFEN_Pos)                 /*!< 0x00400000 */
#define ADC_CCR_VREFEN            ADC_CCR_VREFEN_Msk                            /*!< ADC internal path to VrefInt enable */

#define ADC_CCR_TSEN_Pos          (23U)
#define ADC_CCR_TSEN_Msk          (0x1UL << ADC_CCR_TSEN_Pos)                   /*!< 0x00800000 */
#define ADC_CCR_TSEN              ADC_CCR_TSEN_Msk                              /*!< ADC internal path to temperature sensor enable */

/****************************************************************************/
/*                                                                          */
/*                      Analog Comparators (COMP)                           */
/*                                                                          */
/****************************************************************************/
/**********************  Bit definition for COMP_CSR register  **************/
#define COMP_CSR_EN_Pos            (0U)
#define COMP_CSR_EN_Msk            (0x1UL << COMP_CSR_EN_Pos)                  /*!< 0x00000001 */
#define COMP_CSR_EN                COMP_CSR_EN_Msk                             /*!< Comparator enable */
#define COMP_CSR_COMP1_EN          COMP_CSR_EN
#define COMP_CSR_COMP2_EN          COMP_CSR_EN

#define COMP_CSR_INMSEL_Pos        (6U)
#define COMP_CSR_INMSEL_Msk        (0x3UL << COMP_CSR_INMSEL_Pos)              /*!< 0x000000C0 */
#define COMP_CSR_INMSEL            COMP_CSR_INMSEL_Msk                         /*!< desc INMSEL */
#define COMP_CSR_INMSEL_0          (0x1UL << COMP_CSR_INMSEL_Pos)              /*!< 0x00000040 */
#define COMP_CSR_INMSEL_1          (0x2UL << COMP_CSR_INMSEL_Pos)              /*!< 0x00000080 */

#define COMP_CSR_INPSEL_Pos        (8U)
#define COMP_CSR_INPSEL_Msk        (0x3UL << COMP_CSR_INPSEL_Pos)              /*!< 0x00000300 */
#define COMP_CSR_INPSEL            COMP_CSR_INPSEL_Msk                         /*!< desc INPSEL */
#define COMP_CSR_INPSEL_0          (0x1UL << COMP_CSR_INPSEL_Pos)              /*!< 0x00000010 */
#define COMP_CSR_INPSEL_1          (0x2UL << COMP_CSR_INPSEL_Pos)              /*!< 0x00000020 */

#define COMP_CSR_WINMODE_Pos       (11U)
#define COMP_CSR_WINMODE_Msk       (0x1UL << COMP_CSR_WINMODE_Pos)             /*!< 0x00000800 */
#define COMP_CSR_WINMODE           COMP_CSR_WINMODE_Msk                        /*!< Pair of comparators window mode. Bit intended to be used with COMP common instance (COMP_Common_TypeDef) */

#define COMP_CSR_POLARITY_Pos      (15U)
#define COMP_CSR_POLARITY_Msk      (0x1UL << COMP_CSR_POLARITY_Pos)            /*!< 0x00008000 */
#define COMP_CSR_POLARITY          COMP_CSR_POLARITY_Msk                       /*!< Comparator output polarity */

#define COMP_CSR_PWRMODE_Pos       (18U)
#define COMP_CSR_PWRMODE_Msk       (0x1UL << COMP_CSR_PWRMODE_Pos)             /*!< 0x00008000 */
#define COMP_CSR_PWRMODE           COMP_CSR_PWRMODE_Msk                        /*!< Comparator output polarity */

#define COMP_CSR_COMP_VCDIV_Pos     (20U)
#define COMP_CSR_COMP_VCDIV_Msk     (0x3FUL << COMP_CSR_COMP_VCDIV_Pos)          /*!< 0x03F00000 */
#define COMP_CSR_COMP_VCDIV         COMP_CSR_COMP_VCDIV_Msk                      /*!< Comparator voltage divider */
#define COMP_CSR_COMP_VCDIV_0       (0x1UL << COMP_CSR_COMP_VCDIV_Pos)           /*!< 0x00100000 */
#define COMP_CSR_COMP_VCDIV_1       (0x2UL << COMP_CSR_COMP_VCDIV_Pos)           /*!< 0x00200000 */
#define COMP_CSR_COMP_VCDIV_2       (0x4UL << COMP_CSR_COMP_VCDIV_Pos)           /*!< 0x00400000 */
#define COMP_CSR_COMP_VCDIV_3       (0x8UL << COMP_CSR_COMP_VCDIV_Pos)           /*!< 0x00800000 */
#define COMP_CSR_COMP_VCDIV_4       (0x10UL << COMP_CSR_COMP_VCDIV_Pos)          /*!< 0x01000000 */
#define COMP_CSR_COMP_VCDIV_5       (0x20UL << COMP_CSR_COMP_VCDIV_Pos)          /*!< 0x02000000 */

