OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx5.h
#define TK_CR1_EXTCMODEN_Pos                (3U)
#define TK_CR1_EXTCMODEN_Msk                (0x1UL << TK_CR1_EXTCMODEN_Pos) /*!< 0x00000008 */
#define TK_CR1_EXTCMODEN                    TK_CR1_EXTCMODEN_Msk            /*!< EXTCMOD Enable */

#define TK_CR1_ICOPA_Pos                    (4U)
#define TK_CR1_ICOPA_Msk                    (0x1UL << TK_CR1_ICOPA_Pos)     /*!< 0x00000010 */
#define TK_CR1_ICOPA                        TK_CR1_ICOPA_Msk                /*!< Sidac current select */

#define TK_CR1_COPAMODE_Pos                 (5U)
#define TK_CR1_COPAMODE_Msk                 (0x1UL << TK_CR1_COPAMODE_Pos)  /*!< 0x00000020 */
#define TK_CR1_COPAMODE                     TK_CR1_COPAMODE_Msk            

#define TK_CR1_COPADATA_Pos                 (6U)
#define TK_CR1_COPADATA_Msk                 (0x3UL << TK_CR1_COPADATA_Pos)  /*!< 0x000000C0 */
#define TK_CR1_COPADATA                     TK_CR1_COPADATA_Msk             
#define TK_CR1_COPADATA_0                   (0x1UL << TK_CR1_COPADATA_Pos)  /*!< 0x00000040 */
#define TK_CR1_COPADATA_1                   (0x2UL << TK_CR1_COPADATA_Pos)  /*!< 0x00000080 */

#define TK_CR1_VCCTKCR_Pos                  (8U)
#define TK_CR1_VCCTKCR_Msk                  (0x7UL << TK_CR1_VCCTKCR_Pos)   /*!< 0x00000700 */
#define TK_CR1_VCCTKCR                      TK_CR1_VCCTKCR_Msk              /*!< VCCTK voltage selection */
#define TK_CR1_VCCTKCR_0                    (0x1UL << TK_CR1_VCCTKCR_Pos)   /*!< 0x00000100 */
#define TK_CR1_VCCTKCR_1                    (0x2UL << TK_CR1_VCCTKCR_Pos)   /*!< 0x00000200 */
#define TK_CR1_VCCTKCR_2                    (0x4UL << TK_CR1_VCCTKCR_Pos)   /*!< 0x00000400 */

#define TK_CR1_VCC1CR_Pos                   (11U)
#define TK_CR1_VCC1CR_Msk                   (0x7UL << TK_CR1_VCC1CR_Pos)    /*!< 0x00003800 */
#define TK_CR1_VCC1CR                       TK_CR1_VCC1CR_Msk               /*!< VCC1 voltage selection */
#define TK_CR1_VCC1CR_0                     (0x1UL << TK_CR1_VCC1CR_Pos)    /*!< 0x00000800 */
#define TK_CR1_VCC1CR_1                     (0x2UL << TK_CR1_VCC1CR_Pos)    /*!< 0x00001000 */
#define TK_CR1_VCC1CR_2                     (0x4UL << TK_CR1_VCC1CR_Pos)    /*!< 0x00002000 */

#define TK_CR1_MIDACSTEP_Pos                (14U)
#define TK_CR1_MIDACSTEP_Msk                (0x1UL << TK_CR1_MIDACSTEP_Pos) /*!< 0x00004000 */
#define TK_CR1_MIDACSTEP                    TK_CR1_MIDACSTEP_Msk            /*!< MIDAC Step Select */

#define TK_CR1_SIDACSTEP_Pos                (15U)
#define TK_CR1_SIDACSTEP_Msk                (0x1UL << TK_CR1_SIDACSTEP_Pos) /*!< 0x00008000 */
#define TK_CR1_SIDACSTEP                    TK_CR1_SIDACSTEP_Msk            /*!< SIDAC Step Select */

#define TK_CR1_CFT_Pos                      (16U)
#define TK_CR1_CFT_Msk                      (0x7UL << TK_CR1_CFT_Pos)       /*!< 0x00070000 */
#define TK_CR1_CFT                          TK_CR1_CFT_Msk                   
#define TK_CR1_CFT_0                        (0x1UL << TK_CR1_CFT_Pos)       /*!< 0x00010000 */
#define TK_CR1_CFT_1                        (0x2UL << TK_CR1_CFT_Pos)       /*!< 0x00020000 */
#define TK_CR1_CFT_2                        (0x4UL << TK_CR1_CFT_Pos)       /*!< 0x00040000 */

#define TK_CR1_VCCTKEN_Pos                  (19U)
#define TK_CR1_VCCTKEN_Msk                  (0x1UL << TK_CR1_VCCTKEN_Pos)   /*!< 0x00080000 */
#define TK_CR1_VCCTKEN                      TK_CR1_VCCTKEN_Msk   

#define TK_CR1_INTCMODEN_Pos                (20U)
#define TK_CR1_INTCMODEN_Msk                (0x1UL << TK_CR1_INTCMODEN_Pos) /*!< 0x00100000 */
#define TK_CR1_INTCMODEN                    TK_CR1_INTCMODEN_Msk   

#define TK_CR1_CMPHYSEN_Pos                 (21U)
#define TK_CR1_CMPHYSEN_Msk                 (0x1UL << TK_CR1_CMPHYSEN_Pos)   /*!< 0x00200000 */
#define TK_CR1_CMPHYSEN                     TK_CR1_CMPHYSEN_Msk   

#define TK_CR1_BUFFEREN_Pos                 (22U)
#define TK_CR1_BUFFEREN_Msk                 (0x1UL << TK_CR1_BUFFEREN_Pos)   /*!< 0x00400000 */
#define TK_CR1_BUFFEREN                     TK_CR1_BUFFEREN_Msk   

#define TK_CR1_DIV_Pos                      (24U)
#define TK_CR1_DIV_Msk                      (0x7UL << TK_CR1_DIV_Pos)       /*!< 0x07000000 */
#define TK_CR1_DIV                          TK_CR1_DIV_Msk                  /*!< TK Clock div */
#define TK_CR1_DIV_0                        (0x1UL << TK_CR1_DIV_Pos)       /*!< 0x01000000 */
#define TK_CR1_DIV_1                        (0x2UL << TK_CR1_DIV_Pos)       /*!< 0x02000000 */
#define TK_CR1_DIV_2                        (0x4UL << TK_CR1_DIV_Pos)       /*!< 0x04000000 */

#define TK_CR1_STDIV_Pos                    (27U)
#define TK_CR1_STDIV_Msk                    (0x7UL << TK_CR1_STDIV_Pos)     /*!< 0x38000000 */
#define TK_CR1_STDIV                        TK_CR1_STDIV_Msk                /*!< ST Clock div */
#define TK_CR1_STDIV_0                      (0x1UL << TK_CR1_STDIV_Pos)     /*!< 0x08000000 */
#define TK_CR1_STDIV_1                      (0x2UL << TK_CR1_STDIV_Pos)     /*!< 0x10000000 */
#define TK_CR1_STDIV_2                      (0x4UL << TK_CR1_STDIV_Pos)     /*!< 0x20000000 */

/*******************  Bit definition for TK_CR2 register  ********************/
#define TK_CR2_START_Pos                    (0U)
#define TK_CR2_START_Msk                    (0x1UL << TK_CR2_START_Pos)      /*!< 0x00000001 */
#define TK_CR2_START                        TK_CR2_START_Msk                 

#define TK_CR2_RSTB_Pos                     (1U)
#define TK_CR2_RSTB_Msk                     (0x1UL << TK_CR2_RSTB_Pos)       /*!< 0x00000002 */
#define TK_CR2_RSTB                         TK_CR2_RSTB_Msk                 

#define TK_CR2_SWCTRL_Pos                   (2U)
#define TK_CR2_SWCTRL_Msk                   (0x1UL << TK_CR2_SWCTRL_Pos)     /*!< 0x00000004 */
#define TK_CR2_SWCTRL                       TK_CR2_SWCTRL_Msk                

#define TK_CR2_CMODCHRG_Pos                 (3U)
#define TK_CR2_CMODCHRG_Msk                 (0x1UL << TK_CR2_CMODCHRG_Pos)   /*!< 0x00000008 */
#define TK_CR2_CMODCHRG                     TK_CR2_CMODCHRG_Msk              

